#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/give-back-cincinnati/gbc-infra/runs/run-C83GtHUFWENbQPDc

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zones.gbc: Reading...
data.cloudflare_zones.gbc: Read complete after 1s [id=86d947abd1990f315eb415450516882e]
cloudflare_page_rule.www_redirect: Refreshing state... [id=82e0b98b0e7ba0a373f495bfea3d464f]
cloudflare_record.gbc_next: Refreshing state... [id=a5db23132cde2c5180bb31b3609bb469]
cloudflare_zone_settings_override.gbc_dev_settings: Refreshing state... [id=f746dcf37d3a9a454301a1744e99af3b]
azurerm_resource_group.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources]
azurerm_virtual_network.gbc_vnet: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.Network/virtualNetworks/gbc-vnet]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.ContainerRegistry/registries/gbcCR]
azurerm_subnet.gbc_subnet: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.Network/virtualNetworks/gbc-vnet/subnets/gbc-subnet]
azurerm_kubernetes_cluster.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourcegroups/gbc-resources/providers/Microsoft.ContainerService/managedClusters/gbc-aks]
data.azurerm_resource_group.aks_resource_group: Reading...
data.azurerm_resource_group.aks_resource_group: Read complete after 0s [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/MC_gbc-resources_gbc-aks_eastus]
azurerm_public_ip.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/MC_gbc-resources_gbc-aks_eastus/providers/Microsoft.Network/publicIPAddresses/gbcPublicIp]
kubernetes_namespace.ingress: Refreshing state... [id=ingress-nginx]
kubernetes_namespace.vault: Refreshing state... [id=vault]
kubernetes_namespace.prod: Refreshing state... [id=prod]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_namespace.stage: Refreshing state... [id=stage]
kubernetes_namespace.new_relic: Refreshing state... [id=new-relic]
helm_release.vault: Refreshing state... [id=gbc]
helm_release.mongodb: Refreshing state... [id=mongodb]
helm_release.redis: Refreshing state... [id=redis]
helm_release.cert-manager: Refreshing state... [id=gbc]
helm_release.nginx_ingress: Refreshing state... [id=gbc]
cloudflare_record.vault: Refreshing state... [id=61901e39fc7cb7999a271d4d732f8ecb]
cloudflare_record.gbc_api: Refreshing state... [id=10ffaed1b982a77ffb8a27224edda9da]
aws_s3_bucket.cloudflare-bucket: Refreshing state... [id=gbc-static]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.gbc_static will be created
  + resource "cloudflare_record" "gbc_static" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "static.givebackcincinnati.org"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "public.r2.dev"
      + zone_id         = "f746dcf37d3a9a454301a1744e99af3b"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @MYoung25, Action: `pull_request`*